{"format": "layers-model", "generatedBy": "keras v3.13.2", "convertedBy": "TensorFlow.js Converter v4.22.0", "modelTopology": {"keras_version": "2.15.0", "backend": "tensorflow", "training_config": {"loss": "binary_crossentropy", "loss_weights": null, "metrics": ["accuracy", {"class_name": "Precision", "config": {"name": "precision", "dtype": "float32", "thresholds": null, "top_k": null, "class_id": null}}, {"class_name": "Recall", "config": {"name": "recall", "dtype": "float32", "thresholds": null, "top_k": null, "class_id": null}}, {"class_name": "AUC", "config": {"name": "auc", "dtype": "float32", "num_thresholds": 200, "curve": "ROC", "summation_method": "interpolation", "multi_label": false, "num_labels": null, "label_weights": null, "from_logits": false}}], "weighted_metrics": null, "run_eagerly": false, "steps_per_execution": 1, "jit_compile": true, "optimizer_config": {"class_name": "Adam", "config": {"name": "adam", "learning_rate": 0.0001250000059371814, "weight_decay": null, "clipnorm": null, "global_clipnorm": null, "clipvalue": null, "use_ema": false, "ema_momentum": 0.99, "ema_overwrite_frequency": null, "loss_scale_factor": null, "gradient_accumulation_steps": null, "beta_1": 0.9, "beta_2": 0.999, "epsilon": 1e-07, "amsgrad": false}}}, "class_name": "Functional", "config": {"name": "functional_1", "trainable": true, "layers": [{"class_name": "InputLayer", "config": {"dtype": "float32", "sparse": false, "ragged": false, "name": "input_layer_3", "optional": false, "batchInputShape": [null, 224, 224, 3]}, "name": "input_layer_3", "inbound_nodes": []}, {"class_name": "Rescaling", "config": {"name": "rescaling_1", "trainable": false, "dtype": "float32", "scale": 0.00784313725490196, "offset": -1.0}, "name": "rescaling_1", "inbound_nodes": [[["input_layer_3", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "conv", "trainable": false, "dtype": "float32", "filters": 16, "kernel_size": [3, 3], "strides": [2, 2], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": "glorotuniform", "bias_initializer": "zeros", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "conv", "inbound_nodes": [[["rescaling_1", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "conv_bn", "trainable": false, "dtype": "float32", "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": "zeros", "gamma_initializer": "ones", "moving_mean_initializer": "zeros", "moving_variance_initializer": "ones", "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "conv_bn", "inbound_nodes": [[["conv", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_18", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "activation_18", "inbound_nodes": [[["conv_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "expanded_conv_depthwise_pad", "trainable": false, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "expanded_conv_depthwise_pad", "inbound_nodes": [[["activation_18", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv_depthwise", "trainable": false, "dtype": "float32", "depth_multiplier": 1, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "depthwise_initializer": "glorotuniform", "bias_initializer": "zeros", "depthwise_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null}, "name": "expanded_conv_depthwise", "inbound_nodes": [[["expanded_conv_depthwise_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_depthwise_bn", "trainable": false, "dtype": "float32", "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": "zeros", "gamma_initializer": "ones", "moving_mean_initializer": "zeros", "moving_variance_initializer": "ones", "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_depthwise_bn", "inbound_nodes": [[["expanded_conv_depthwise", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_14", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_14", "inbound_nodes": [[["expanded_conv_depthwise_bn", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "expanded_conv_squeeze_excite_avg_pool", "trainable": false, "dtype": "float32", "data_format": "channels_last", "keepDims": true}, "name": "expanded_conv_squeeze_excite_avg_pool", "inbound_nodes": [[["re_lu_14", 0, 0, {}]]]}, {"class_name": "Reshape", "name": "expanded_conv_squeeze_excite_avg_pool_reshape", "config": {"name": "expanded_conv_squeeze_excite_avg_pool_reshape", "trainable": true, "target_shape": [1, 1, 16]}, "inbound_nodes": [[["expanded_conv_squeeze_excite_avg_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_squeeze_excite_conv", "trainable": false, "dtype": "float32", "filters": 8, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": "glorotuniform", "bias_initializer": "zeros", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_squeeze_excite_conv", "inbound_nodes": [[["expanded_conv_squeeze_excite_avg_pool_reshape", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "expanded_conv_squeeze_excite_relu", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "expanded_conv_squeeze_excite_relu", "inbound_nodes": [[["expanded_conv_squeeze_excite_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_squeeze_excite_conv_1", "trainable": false, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": "glorotuniform", "bias_initializer": "zeros", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_squeeze_excite_conv_1", "inbound_nodes": [[["expanded_conv_squeeze_excite_relu", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "expanded_conv_squeeze_excite_mul", "trainable": false, "dtype": "float32"}, "name": "expanded_conv_squeeze_excite_mul", "inbound_nodes": [[["re_lu_14", 0, 0, {}], ["expanded_conv_squeeze_excite_sigmoid", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_project", "trainable": false, "dtype": "float32", "filters": 16, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": "glorotuniform", "bias_initializer": "zeros", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_project", "inbound_nodes": [[["expanded_conv_squeeze_excite_mul", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_project_bn", "trainable": false, "dtype": "float32", "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": "zeros", "gamma_initializer": "ones", "moving_mean_initializer": "zeros", "moving_variance_initializer": "ones", "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_project_bn", "inbound_nodes": [[["expanded_conv_project", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_1_expand", "trainable": false, "dtype": "float32", "filters": 72, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": "glorotuniform", "bias_initializer": "zeros", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_1_expand", "inbound_nodes": [[["expanded_conv_project_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_1_expand_bn", "trainable": false, "dtype": "float32", "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": "zeros", "gamma_initializer": "ones", "moving_mean_initializer": "zeros", "moving_variance_initializer": "ones", "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_1_expand_bn", "inbound_nodes": [[["expanded_conv_1_expand", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_16", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_16", "inbound_nodes": [[["expanded_conv_1_expand_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "expanded_conv_1_depthwise_pad", "trainable": false, "dtype": "float32", "padding": [[0, 1], [0, 1]], "data_format": "channels_last"}, "name": "expanded_conv_1_depthwise_pad", "inbound_nodes": [[["re_lu_16", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv_1_depthwise", "trainable": false, "dtype": "float32", "depth_multiplier": 1, "kernel_size": [3, 3], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "depthwise_initializer": "glorotuniform", "bias_initializer": "zeros", "depthwise_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null}, "name": "expanded_conv_1_depthwise", "inbound_nodes": [[["expanded_conv_1_depthwise_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_1_depthwise_bn", "trainable": false, "dtype": "float32", "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": "zeros", "gamma_initializer": "ones", "moving_mean_initializer": "zeros", "moving_variance_initializer": "ones", "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_1_depthwise_bn", "inbound_nodes": [[["expanded_conv_1_depthwise", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_17", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_17", "inbound_nodes": [[["expanded_conv_1_depthwise_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_1_project", "trainable": false, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": "glorotuniform", "bias_initializer": "zeros", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_1_project", "inbound_nodes": [[["re_lu_17", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_1_project_bn", "trainable": false, "dtype": "float32", "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": "zeros", "gamma_initializer": "ones", "moving_mean_initializer": "zeros", "moving_variance_initializer": "ones", "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_1_project_bn", "inbound_nodes": [[["expanded_conv_1_project", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_2_expand", "trainable": false, "dtype": "float32", "filters": 88, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": "glorotuniform", "bias_initializer": "zeros", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_2_expand", "inbound_nodes": [[["expanded_conv_1_project_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_2_expand_bn", "trainable": false, "dtype": "float32", "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": "zeros", "gamma_initializer": "ones", "moving_mean_initializer": "zeros", "moving_variance_initializer": "ones", "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_2_expand_bn", "inbound_nodes": [[["expanded_conv_2_expand", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_18", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_18", "inbound_nodes": [[["expanded_conv_2_expand_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv_2_depthwise", "trainable": false, "dtype": "float32", "depth_multiplier": 1, "kernel_size": [3, 3], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "depthwise_initializer": "glorotuniform", "bias_initializer": "zeros", "depthwise_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null}, "name": "expanded_conv_2_depthwise", "inbound_nodes": [[["re_lu_18", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_2_depthwise_bn", "trainable": false, "dtype": "float32", "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": "zeros", "gamma_initializer": "ones", "moving_mean_initializer": "zeros", "moving_variance_initializer": "ones", "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_2_depthwise_bn", "inbound_nodes": [[["expanded_conv_2_depthwise", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "re_lu_19", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "re_lu_19", "inbound_nodes": [[["expanded_conv_2_depthwise_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_2_project", "trainable": false, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": "glorotuniform", "bias_initializer": "zeros", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_2_project", "inbound_nodes": [[["re_lu_19", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_2_project_bn", "trainable": false, "dtype": "float32", "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": "zeros", "gamma_initializer": "ones", "moving_mean_initializer": "zeros", "moving_variance_initializer": "ones", "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_2_project_bn", "inbound_nodes": [[["expanded_conv_2_project", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "expanded_conv_2_add", "trainable": false, "dtype": "float32"}, "name": "expanded_conv_2_add", "inbound_nodes": [[["expanded_conv_1_project_bn", 0, 0, {}], ["expanded_conv_2_project_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_3_expand", "trainable": false, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": "glorotuniform", "bias_initializer": "zeros", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_3_expand", "inbound_nodes": [[["expanded_conv_2_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_3_expand_bn", "trainable": false, "dtype": "float32", "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": "zeros", "gamma_initializer": "ones", "moving_mean_initializer": "zeros", "moving_variance_initializer": "ones", "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_3_expand_bn", "inbound_nodes": [[["expanded_conv_3_expand", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_19", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "activation_19", "inbound_nodes": [[["expanded_conv_3_expand_bn", 0, 0, {}]]]}, {"class_name": "ZeroPadding2D", "config": {"name": "expanded_conv_3_depthwise_pad", "trainable": false, "dtype": "float32", "padding": [[1, 2], [1, 2]], "data_format": "channels_last"}, "name": "expanded_conv_3_depthwise_pad", "inbound_nodes": [[["activation_19", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv_3_depthwise", "trainable": false, "dtype": "float32", "depth_multiplier": 1, "kernel_size": [5, 5], "strides": [2, 2], "padding": "valid", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "depthwise_initializer": "glorotuniform", "bias_initializer": "zeros", "depthwise_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null}, "name": "expanded_conv_3_depthwise", "inbound_nodes": [[["expanded_conv_3_depthwise_pad", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_3_depthwise_bn", "trainable": false, "dtype": "float32", "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": "zeros", "gamma_initializer": "ones", "moving_mean_initializer": "zeros", "moving_variance_initializer": "ones", "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_3_depthwise_bn", "inbound_nodes": [[["expanded_conv_3_depthwise", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_20", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "activation_20", "inbound_nodes": [[["expanded_conv_3_depthwise_bn", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "expanded_conv_3_squeeze_excite_avg_pool", "trainable": false, "dtype": "float32", "data_format": "channels_last", "keepDims": true}, "name": "expanded_conv_3_squeeze_excite_avg_pool", "inbound_nodes": [[["activation_20", 0, 0, {}]]]}, {"class_name": "Reshape", "name": "expanded_conv_3_squeeze_excite_avg_pool_reshape", "config": {"name": "expanded_conv_3_squeeze_excite_avg_pool_reshape", "trainable": true, "target_shape": [1, 1, 96]}, "inbound_nodes": [[["expanded_conv_3_squeeze_excite_avg_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_3_squeeze_excite_conv", "trainable": false, "dtype": "float32", "filters": 24, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": "glorotuniform", "bias_initializer": "zeros", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_3_squeeze_excite_conv", "inbound_nodes": [[["expanded_conv_3_squeeze_excite_avg_pool_reshape", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "expanded_conv_3_squeeze_excite_relu", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "expanded_conv_3_squeeze_excite_relu", "inbound_nodes": [[["expanded_conv_3_squeeze_excite_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_3_squeeze_excite_conv_1", "trainable": false, "dtype": "float32", "filters": 96, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": "glorotuniform", "bias_initializer": "zeros", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_3_squeeze_excite_conv_1", "inbound_nodes": [[["expanded_conv_3_squeeze_excite_relu", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "expanded_conv_3_squeeze_excite_mul", "trainable": false, "dtype": "float32"}, "name": "expanded_conv_3_squeeze_excite_mul", "inbound_nodes": [[["activation_20", 0, 0, {}], ["expanded_conv_3_squeeze_excite_sigmoid", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_3_project", "trainable": false, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": "glorotuniform", "bias_initializer": "zeros", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_3_project", "inbound_nodes": [[["expanded_conv_3_squeeze_excite_mul", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_3_project_bn", "trainable": false, "dtype": "float32", "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": "zeros", "gamma_initializer": "ones", "moving_mean_initializer": "zeros", "moving_variance_initializer": "ones", "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_3_project_bn", "inbound_nodes": [[["expanded_conv_3_project", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_4_expand", "trainable": false, "dtype": "float32", "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": "glorotuniform", "bias_initializer": "zeros", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_4_expand", "inbound_nodes": [[["expanded_conv_3_project_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_4_expand_bn", "trainable": false, "dtype": "float32", "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": "zeros", "gamma_initializer": "ones", "moving_mean_initializer": "zeros", "moving_variance_initializer": "ones", "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_4_expand_bn", "inbound_nodes": [[["expanded_conv_4_expand", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_21", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "activation_21", "inbound_nodes": [[["expanded_conv_4_expand_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv_4_depthwise", "trainable": false, "dtype": "float32", "depth_multiplier": 1, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "depthwise_initializer": "glorotuniform", "bias_initializer": "zeros", "depthwise_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null}, "name": "expanded_conv_4_depthwise", "inbound_nodes": [[["activation_21", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_4_depthwise_bn", "trainable": false, "dtype": "float32", "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": "zeros", "gamma_initializer": "ones", "moving_mean_initializer": "zeros", "moving_variance_initializer": "ones", "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_4_depthwise_bn", "inbound_nodes": [[["expanded_conv_4_depthwise", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_22", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "activation_22", "inbound_nodes": [[["expanded_conv_4_depthwise_bn", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "expanded_conv_4_squeeze_excite_avg_pool", "trainable": false, "dtype": "float32", "data_format": "channels_last", "keepDims": true}, "name": "expanded_conv_4_squeeze_excite_avg_pool", "inbound_nodes": [[["activation_22", 0, 0, {}]]]}, {"class_name": "Reshape", "name": "expanded_conv_4_squeeze_excite_avg_pool_reshape", "config": {"name": "expanded_conv_4_squeeze_excite_avg_pool_reshape", "trainable": true, "target_shape": [1, 1, 240]}, "inbound_nodes": [[["expanded_conv_4_squeeze_excite_avg_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_4_squeeze_excite_conv", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": "glorotuniform", "bias_initializer": "zeros", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_4_squeeze_excite_conv", "inbound_nodes": [[["expanded_conv_4_squeeze_excite_avg_pool_reshape", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "expanded_conv_4_squeeze_excite_relu", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "expanded_conv_4_squeeze_excite_relu", "inbound_nodes": [[["expanded_conv_4_squeeze_excite_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_4_squeeze_excite_conv_1", "trainable": false, "dtype": "float32", "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": "glorotuniform", "bias_initializer": "zeros", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_4_squeeze_excite_conv_1", "inbound_nodes": [[["expanded_conv_4_squeeze_excite_relu", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "expanded_conv_4_squeeze_excite_mul", "trainable": false, "dtype": "float32"}, "name": "expanded_conv_4_squeeze_excite_mul", "inbound_nodes": [[["activation_22", 0, 0, {}], ["expanded_conv_4_squeeze_excite_sigmoid", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_4_project", "trainable": false, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": "glorotuniform", "bias_initializer": "zeros", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_4_project", "inbound_nodes": [[["expanded_conv_4_squeeze_excite_mul", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_4_project_bn", "trainable": false, "dtype": "float32", "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": "zeros", "gamma_initializer": "ones", "moving_mean_initializer": "zeros", "moving_variance_initializer": "ones", "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_4_project_bn", "inbound_nodes": [[["expanded_conv_4_project", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "expanded_conv_4_add", "trainable": false, "dtype": "float32"}, "name": "expanded_conv_4_add", "inbound_nodes": [[["expanded_conv_3_project_bn", 0, 0, {}], ["expanded_conv_4_project_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_5_expand", "trainable": false, "dtype": "float32", "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": "glorotuniform", "bias_initializer": "zeros", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_5_expand", "inbound_nodes": [[["expanded_conv_4_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_5_expand_bn", "trainable": false, "dtype": "float32", "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": "zeros", "gamma_initializer": "ones", "moving_mean_initializer": "zeros", "moving_variance_initializer": "ones", "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_5_expand_bn", "inbound_nodes": [[["expanded_conv_5_expand", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_23", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "activation_23", "inbound_nodes": [[["expanded_conv_5_expand_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv_5_depthwise", "trainable": false, "dtype": "float32", "depth_multiplier": 1, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "depthwise_initializer": "glorotuniform", "bias_initializer": "zeros", "depthwise_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null}, "name": "expanded_conv_5_depthwise", "inbound_nodes": [[["activation_23", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_5_depthwise_bn", "trainable": false, "dtype": "float32", "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": "zeros", "gamma_initializer": "ones", "moving_mean_initializer": "zeros", "moving_variance_initializer": "ones", "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_5_depthwise_bn", "inbound_nodes": [[["expanded_conv_5_depthwise", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_24", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "activation_24", "inbound_nodes": [[["expanded_conv_5_depthwise_bn", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "expanded_conv_5_squeeze_excite_avg_pool", "trainable": false, "dtype": "float32", "data_format": "channels_last", "keepDims": true}, "name": "expanded_conv_5_squeeze_excite_avg_pool", "inbound_nodes": [[["activation_24", 0, 0, {}]]]}, {"class_name": "Reshape", "name": "expanded_conv_5_squeeze_excite_avg_pool_reshape", "config": {"name": "expanded_conv_5_squeeze_excite_avg_pool_reshape", "trainable": true, "target_shape": [1, 1, 240]}, "inbound_nodes": [[["expanded_conv_5_squeeze_excite_avg_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_5_squeeze_excite_conv", "trainable": false, "dtype": "float32", "filters": 64, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": "glorotuniform", "bias_initializer": "zeros", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_5_squeeze_excite_conv", "inbound_nodes": [[["expanded_conv_5_squeeze_excite_avg_pool_reshape", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "expanded_conv_5_squeeze_excite_relu", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "expanded_conv_5_squeeze_excite_relu", "inbound_nodes": [[["expanded_conv_5_squeeze_excite_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_5_squeeze_excite_conv_1", "trainable": false, "dtype": "float32", "filters": 240, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": "glorotuniform", "bias_initializer": "zeros", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_5_squeeze_excite_conv_1", "inbound_nodes": [[["expanded_conv_5_squeeze_excite_relu", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "expanded_conv_5_squeeze_excite_mul", "trainable": false, "dtype": "float32"}, "name": "expanded_conv_5_squeeze_excite_mul", "inbound_nodes": [[["activation_24", 0, 0, {}], ["expanded_conv_5_squeeze_excite_sigmoid", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_5_project", "trainable": false, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": "glorotuniform", "bias_initializer": "zeros", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_5_project", "inbound_nodes": [[["expanded_conv_5_squeeze_excite_mul", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_5_project_bn", "trainable": false, "dtype": "float32", "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": "zeros", "gamma_initializer": "ones", "moving_mean_initializer": "zeros", "moving_variance_initializer": "ones", "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_5_project_bn", "inbound_nodes": [[["expanded_conv_5_project", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "expanded_conv_5_add", "trainable": false, "dtype": "float32"}, "name": "expanded_conv_5_add", "inbound_nodes": [[["expanded_conv_4_add", 0, 0, {}], ["expanded_conv_5_project_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_6_expand", "trainable": false, "dtype": "float32", "filters": 120, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": "glorotuniform", "bias_initializer": "zeros", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_6_expand", "inbound_nodes": [[["expanded_conv_5_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_6_expand_bn", "trainable": false, "dtype": "float32", "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": "zeros", "gamma_initializer": "ones", "moving_mean_initializer": "zeros", "moving_variance_initializer": "ones", "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_6_expand_bn", "inbound_nodes": [[["expanded_conv_6_expand", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_25", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "activation_25", "inbound_nodes": [[["expanded_conv_6_expand_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv_6_depthwise", "trainable": false, "dtype": "float32", "depth_multiplier": 1, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "depthwise_initializer": "glorotuniform", "bias_initializer": "zeros", "depthwise_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null}, "name": "expanded_conv_6_depthwise", "inbound_nodes": [[["activation_25", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_6_depthwise_bn", "trainable": false, "dtype": "float32", "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": "zeros", "gamma_initializer": "ones", "moving_mean_initializer": "zeros", "moving_variance_initializer": "ones", "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_6_depthwise_bn", "inbound_nodes": [[["expanded_conv_6_depthwise", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_26", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "activation_26", "inbound_nodes": [[["expanded_conv_6_depthwise_bn", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "expanded_conv_6_squeeze_excite_avg_pool", "trainable": false, "dtype": "float32", "data_format": "channels_last", "keepDims": true}, "name": "expanded_conv_6_squeeze_excite_avg_pool", "inbound_nodes": [[["activation_26", 0, 0, {}]]]}, {"class_name": "Reshape", "name": "expanded_conv_6_squeeze_excite_avg_pool_reshape", "config": {"name": "expanded_conv_6_squeeze_excite_avg_pool_reshape", "trainable": true, "target_shape": [1, 1, 120]}, "inbound_nodes": [[["expanded_conv_6_squeeze_excite_avg_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_6_squeeze_excite_conv", "trainable": false, "dtype": "float32", "filters": 32, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": "glorotuniform", "bias_initializer": "zeros", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_6_squeeze_excite_conv", "inbound_nodes": [[["expanded_conv_6_squeeze_excite_avg_pool_reshape", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "expanded_conv_6_squeeze_excite_relu", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "expanded_conv_6_squeeze_excite_relu", "inbound_nodes": [[["expanded_conv_6_squeeze_excite_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_6_squeeze_excite_conv_1", "trainable": false, "dtype": "float32", "filters": 120, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": "glorotuniform", "bias_initializer": "zeros", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_6_squeeze_excite_conv_1", "inbound_nodes": [[["expanded_conv_6_squeeze_excite_relu", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "expanded_conv_6_squeeze_excite_mul", "trainable": false, "dtype": "float32"}, "name": "expanded_conv_6_squeeze_excite_mul", "inbound_nodes": [[["activation_26", 0, 0, {}], ["expanded_conv_6_squeeze_excite_sigmoid", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_6_project", "trainable": false, "dtype": "float32", "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": "glorotuniform", "bias_initializer": "zeros", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_6_project", "inbound_nodes": [[["expanded_conv_6_squeeze_excite_mul", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_6_project_bn", "trainable": false, "dtype": "float32", "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": "zeros", "gamma_initializer": "ones", "moving_mean_initializer": "zeros", "moving_variance_initializer": "ones", "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_6_project_bn", "inbound_nodes": [[["expanded_conv_6_project", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_7_expand", "trainable": false, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": "glorotuniform", "bias_initializer": "zeros", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_7_expand", "inbound_nodes": [[["expanded_conv_6_project_bn", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_7_expand_bn", "trainable": false, "dtype": "float32", "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": "zeros", "gamma_initializer": "ones", "moving_mean_initializer": "zeros", "moving_variance_initializer": "ones", "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_7_expand_bn", "inbound_nodes": [[["expanded_conv_7_expand", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_27", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "activation_27", "inbound_nodes": [[["expanded_conv_7_expand_bn", 0, 0, {}]]]}, {"class_name": "DepthwiseConv2D", "config": {"name": "expanded_conv_7_depthwise", "trainable": false, "dtype": "float32", "depth_multiplier": 1, "kernel_size": [5, 5], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "activation": "linear", "use_bias": false, "depthwise_initializer": "glorotuniform", "bias_initializer": "zeros", "depthwise_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "depthwise_constraint": null, "bias_constraint": null}, "name": "expanded_conv_7_depthwise", "inbound_nodes": [[["activation_27", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_7_depthwise_bn", "trainable": false, "dtype": "float32", "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": "zeros", "gamma_initializer": "ones", "moving_mean_initializer": "zeros", "moving_variance_initializer": "ones", "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_7_depthwise_bn", "inbound_nodes": [[["expanded_conv_7_depthwise", 0, 0, {}]]]}, {"class_name": "Activation", "config": {"name": "activation_28", "trainable": false, "dtype": "float32", "activation": "swish"}, "name": "activation_28", "inbound_nodes": [[["expanded_conv_7_depthwise_bn", 0, 0, {}]]]}, {"class_name": "GlobalAveragePooling2D", "config": {"name": "expanded_conv_7_squeeze_excite_avg_pool", "trainable": false, "dtype": "float32", "data_format": "channels_last", "keepDims": true}, "name": "expanded_conv_7_squeeze_excite_avg_pool", "inbound_nodes": [[["activation_28", 0, 0, {}]]]}, {"class_name": "Reshape", "name": "expanded_conv_7_squeeze_excite_avg_pool_reshape", "config": {"name": "expanded_conv_7_squeeze_excite_avg_pool_reshape", "trainable": true, "target_shape": [1, 1, 144]}, "inbound_nodes": [[["expanded_conv_7_squeeze_excite_avg_pool", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_7_squeeze_excite_conv", "trainable": false, "dtype": "float32", "filters": 40, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": "glorotuniform", "bias_initializer": "zeros", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_7_squeeze_excite_conv", "inbound_nodes": [[["expanded_conv_7_squeeze_excite_avg_pool_reshape", 0, 0, {}]]]}, {"class_name": "ReLU", "config": {"name": "expanded_conv_7_squeeze_excite_relu", "trainable": false, "dtype": "float32", "max_value": null, "negative_slope": 0.0, "threshold": 0.0}, "name": "expanded_conv_7_squeeze_excite_relu", "inbound_nodes": [[["expanded_conv_7_squeeze_excite_conv", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_7_squeeze_excite_conv_1", "trainable": false, "dtype": "float32", "filters": 144, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": true, "kernel_initializer": "glorotuniform", "bias_initializer": "zeros", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_7_squeeze_excite_conv_1", "inbound_nodes": [[["expanded_conv_7_squeeze_excite_relu", 0, 0, {}]]]}, {"class_name": "Multiply", "config": {"name": "expanded_conv_7_squeeze_excite_mul", "trainable": false, "dtype": "float32"}, "name": "expanded_conv_7_squeeze_excite_mul", "inbound_nodes": [[["activation_28", 0, 0, {}], ["expanded_conv_7_squeeze_excite_sigmoid", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_7_project", "trainable": false, "dtype": "float32", "filters": 48, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": "glorotuniform", "bias_initializer": "zeros", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_7_project", "inbound_nodes": [[["expanded_conv_7_squeeze_excite_mul", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_7_project_bn", "trainable": false, "dtype": "float32", "axis": -1, "momentum": 0.999, "epsilon": 0.001, "center": true, "scale": true, "beta_initializer": "zeros", "gamma_initializer": "ones", "moving_mean_initializer": "zeros", "moving_variance_initializer": "ones", "beta_regularizer": null, "gamma_regularizer": null, "beta_constraint": null, "gamma_constraint": null}, "name": "expanded_conv_7_project_bn", "inbound_nodes": [[["expanded_conv_7_project", 0, 0, {}]]]}, {"class_name": "Add", "config": {"name": "expanded_conv_7_add", "trainable": false, "dtype": "float32"}, "name": "expanded_conv_7_add", "inbound_nodes": [[["expanded_conv_6_project_bn", 0, 0, {}], ["expanded_conv_7_project_bn", 0, 0, {}]]]}, {"class_name": "Conv2D", "config": {"name": "expanded_conv_8_expand", "trainable": false, "dtype": "float32", "filters": 288, "kernel_size": [1, 1], "strides": [1, 1], "padding": "same", "data_format": "channels_last", "dilation_rate": [1, 1], "groups": 1, "activation": "linear", "use_bias": false, "kernel_initializer": "glorotuniform", "bias_initializer": "zeros", "kernel_regularizer": null, "bias_regularizer": null, "activity_regularizer": null, "kernel_constraint": null, "bias_constraint": null}, "name": "expanded_conv_8_expand", "inbound_nodes": [[["expanded_conv_7_add", 0, 0, {}]]]}, {"class_name": "BatchNormalization", "config": {"name": "expanded_conv_8_expand_bn", "trainable": false, "dtype": "float32", 